workflow.org
#+STYLE: <link rel="stylesheet" type="text/css" href="css/worg.css" />
#+TITLE: О процессе разработки
#+AUTHOR: Urist McLisper
#+EMAIL: mclisper@gmail.com

На мой взгляд, github - самое подходящее место для такого рода работы: там для каждого проекта есть и вики своя, которая поддерживает различные форматы разметки текста (в том-числе org-mode, mediawiki, markdown) и чтобы ее редактировать - не нужно знать git, нужно лишь иметь аккаунт на github; кроме того на github можно "хостить" и код и "сайт" (github pages), где все будет красиво сверстано.


Пока что мне видится примерно такой процесс разработки:
- коллективное редактирование вики - там хаос и зона повышенной
  энтропии, доступ будет открыт всем на редактирование, можно смело
  вносить идеи и предложения.
- спустя какое-то время, вещи, которые более менее утвердились,
  подробно описаны, коммитятся в репозиторий и верстается красивая
  html-страничка для чтения.
