workflow.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>О процессе разработки</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="О процессе разработки"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-01-29 18:52:21 MSK"/>
<meta name="author" content="Urist McLisper"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="css/worg.css" />

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">О процессе разработки</h1>

<p>На мой взгляд, github - самое подходящее место для такого рода работы: там для каждого проекта есть и вики своя, которая поддерживает различные форматы разметки текста (в том-числе org-mode, mediawiki, markdown) и чтобы ее редактировать - не нужно знать git, нужно лишь иметь аккаунт на github; кроме того на github можно "хостить" и код и "сайт" (github pages), где все будет красиво сверстано.
</p>

<p>
Пока что мне видится примерно такой процесс разработки:
</p><ul>
<li>коллективное редактирование вики - там хаос и зона повышенной
  энтропии, доступ будет открыт всем на редактирование, можно смело
  вносить идеи и предложения.
</li>
<li>спустя какое-то время, вещи, которые более менее утвердились,
  подробно описаны, коммитятся в репозиторий и верстается красивая
  html-страничка для чтения.
</li>
</ul>

</div>

<div id="postamble">
<p class="date">Date: 2012-01-29 18:52:21 MSK</p>
<p class="author">Author: Urist McLisper</p>
<p class="creator">Org version 7.8.03 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
